In [7]:
import pandas as pd
df = pd.read_csv(r"E:\vscode\ICRISAT-District Level Data - ICRISAT-District Level Data.csv")
df.head()

,Dist Code,Year,State Code,State Name,Dist Name,RICE AREA (1000 ha),RICE PRODUCTION (1000 tons),RICE YIELD (Kg per ha),WHEAT AREA (1000 ha),WHEAT PRODUCTION (1000 tons),...,SUGARCANE YIELD (Kg per ha),COTTON AREA (1000 ha),COTTON PRODUCTION (1000 tons),COTTON YIELD (Kg per ha),FRUITS AREA (1000 ha),VEGETABLES AREA (1000 ha),FRUITS AND VEGETABLES AREA (1000 ha),POTATOES AREA (1000 ha),ONION AREA (1000 ha),FODDER AREA (1000 ha)
0,1,1966,14,Chhattisgarh,Durg,548.0,185.0,337.59,44.0,20.0,...,1777.78,0.0,0.0,0.0,5.95,6.64,12.59,0.01,0.60,0.47
1,1,1967,14,Chhattisgarh,Durg,547.0,409.0,747.71,50.0,26.0,...,1500.00,0.0,0.0,0.0,5.77,7.24,13.02,0.01,0.56,1.23
2,1,1968,14,Chhattisgarh,Durg,556.3,468.0,841.27,53.7,30.0,...,1000.00,0.0,0.0,0.0,5.41,7.40,12.81,0.10,0.58,1.02
3,1,1969,14,Chhattisgarh,Durg,563.4,400.8,711.40,49.4,26.5,...,1900.00,0.0,0.0,0.0,5.52,7.16,12.69,0.01,0.56,0.84
4,1,1970,14,Chhattisgarh,Durg,571.6,473.6,828.55,44.2,29.0,...,2000.00,0.0,0.0,0.0,5.45,7.19,12.64,0.02,0.52,0.42

In [8]:
df.columns = (
    df.columns
    .str.strip()           # remove extra spaces
    .str.lower()           # make lowercase
    .str.replace(" ", "_") # replace spaces with _
    .str.replace("(", "")  # remove (
    .str.replace(")", "")  # remove )
    .str.replace("/", "_") # replace / with _
    .str.replace("-", "_") # replace - with _
)

df.head()

,dist_code,year,state_code,state_name,dist_name,rice_area_1000_ha,rice_production_1000_tons,rice_yield_kg_per_ha,wheat_area_1000_ha,wheat_production_1000_tons,...,sugarcane_yield_kg_per_ha,cotton_area_1000_ha,cotton_production_1000_tons,cotton_yield_kg_per_ha,fruits_area_1000_ha,vegetables_area_1000_ha,fruits_and_vegetables_area_1000_ha,potatoes_area_1000_ha,onion_area_1000_ha,fodder_area_1000_ha
0,1,1966,14,Chhattisgarh,Durg,548.0,185.0,337.59,44.0,20.0,...,1777.78,0.0,0.0,0.0,5.95,6.64,12.59,0.01,0.60,0.47
1,1,1967,14,Chhattisgarh,Durg,547.0,409.0,747.71,50.0,26.0,...,1500.00,0.0,0.0,0.0,5.77,7.24,13.02,0.01,0.56,1.23
2,1,1968,14,Chhattisgarh,Durg,556.3,468.0,841.27,53.7,30.0,...,1000.00,0.0,0.0,0.0,5.41,7.40,12.81,0.10,0.58,1.02
3,1,1969,14,Chhattisgarh,Durg,563.4,400.8,711.40,49.4,26.5,...,1900.00,0.0,0.0,0.0,5.52,7.16,12.69,0.01,0.56,0.84
4,1,1970,14,Chhattisgarh,Durg,571.6,473.6,828.55,44.2,29.0,...,2000.00,0.0,0.0,0.0,5.45,7.19,12.64,0.02,0.52,0.42

In [16]:
!pip install mysql-connector-python
!pip install SQLAlchemy
!pip install pymysql

Requirement already satisfied: mysql-connector-python in c:\users\dell\anaconda3\lib\site-packages (9.4.0)
Requirement already satisfied: SQLAlchemy in c:\users\dell\anaconda3\lib\site-packages (2.0.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\dell\anaconda3\lib\site-packages (from SQLAlchemy) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\dell\anaconda3\lib\site-packages (from SQLAlchemy) (4.12.2)
Collecting pymysql
  Using cached pymysql-1.1.2-py3-none-any.whl.metadata (4.3 kB)
Using cached pymysql-1.1.2-py3-none-any.whl (45 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.1.2

In [17]:
from sqlalchemy import create_engine
import pymysql

engine = create_engine("mysql+pymysql://root:poorani09@localhost/agridb")

df.to_sql("agri_data", engine, if_exists="replace", index=False)

print("Table created and data uploaded!")

Table created and data uploaded!

In [36]:
import mysql.connector

connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password="poorani09",
    database="agridb"
)
cursor = connection.cursor(buffered=True)
cursor.execute("SELECT * FROM agridb.agri_data")

In [37]:
pd.read_sql("SELECT COUNT(*) FROM agri_data;", engine)

   COUNT(*)
0     16146

In [38]:
#1. Year-wise Trend of Rice Production Across States (Top 3)
query = """
SELECT year, state_name, SUM(rice_production_1000_tons) AS rice_prod
FROM agri_data
GROUP BY year, state_name
ORDER BY rice_prod DESC
LIMIT 3;
"""

pd.read_sql(query, engine)

   year   state_name  rice_prod
0  2015  West Bengal   15948.26
1  2014  West Bengal   15927.20
2  2017  West Bengal   15658.94

In [39]:
#2. Top 5 Districts by Wheat Yield Increase (Last 5 Years — Simple Version)
query = """
SELECT dist_name, AVG(wheat_yield_kg_per_ha) AS avg_wheat_yield
FROM agri_data
GROUP BY dist_name
ORDER BY avg_wheat_yield DESC
LIMIT 5;
"""

pd.read_sql(query, engine)

   dist_name  avg_wheat_yield
0   Ludhiana      4059.480192
1    Sangrur      3845.233654
2    Patiala      3717.696154
3  Jalandhar      3620.079231
4   Ferozpur      3592.055385

In [40]:
#3. States With Highest Oilseed Production
query = """
SELECT state_name, SUM(oilseeds_production_1000_tons) AS total_oilseed
FROM agri_data
GROUP BY state_name
ORDER BY total_oilseed DESC
LIMIT 5;
"""

pd.read_sql(query, engine)

       state_name  total_oilseed
0  Madhya Pradesh      153594.79
1         Gujarat      126224.01
2       Rajasthan      122726.86
3     Maharashtra       95567.91
4  Andhra Pradesh       76888.09

In [41]:
#4. District-wise Area vs Production (Rice, Wheat, Maize)
query = """
SELECT dist_name,
       AVG(rice_area_1000_ha) AS rice_area,
       AVG(rice_production_1000_tons) AS rice_production,
       AVG(wheat_area_1000_ha) AS wheat_area,
       AVG(wheat_production_1000_tons) AS wheat_production,
       AVG(maize_area_1000_ha) AS maize_area,
       AVG(maize_production_1000_tons) AS maize_production
FROM agri_data
GROUP BY dist_name;
"""

pd.read_sql(query, engine)

,dist_name,rice_area,rice_production,wheat_area,wheat_production,maize_area,maize_production
0,Durg,693.631923,750.007500,40.868077,28.005192,3.814808,4.436731
1,Bastar,561.343269,606.235192,2.146346,2.497500,29.824231,47.620769
2,Raipur,859.622692,1074.833654,14.052692,13.949038,2.148654,3.343654
3,Bilaspur,684.812308,848.180192,19.953077,17.010962,10.745962,13.172692
4,Raigarh,396.758846,404.744231,3.247692,4.003654,8.077885,11.165000
...,...,...,...,...,...,...,...
306,Hazaribagh,188.588400,208.835200,12.380400,17.554800,31.998400,36.364200
307,Dhanbad,46.499200,53.848400,0.880000,1.171600,3.913600,3.930600
308,Palamau,82.016600,108.677000,17.556200,18.689000,36.497400,32.746600
309,Ranchi,418.320200,395.379600,8.793600,11.489200,11.619400,17.486400
310,Singhbhum,306.737000,336.661800,1.873400,1.961000,6.842800,7.565600

In [42]:
#5. Cotton Production — Top 5 States
query = """
SELECT state_name, SUM(cotton_production_1000_tons) AS cotton_prod
FROM agri_data
GROUP BY state_name
ORDER BY cotton_prod DESC
LIMIT 5;
"""

pd.read_sql(query, engine)

    state_name  cotton_prod
0      Gujarat     31359.57
1  Maharashtra     25217.30
2       Punjab     12960.99
3      Haryana      9851.23
4    Telangana      9410.65

In [47]:
#6. Highest Groundnut Production Districts in 2020
query = """
SELECT dist_name, groundnut_production_1000_tons
FROM agri_data
WHERE groundnut_production_1000_tons IS NOT NULL
ORDER BY groundnut_production_1000_tons DESC
LIMIT 10;
"""
pd.read_sql(query, engine)

    dist_name  groundnut_production_1000_tons
0    Junagadh                         1688.11
1    Junagadh                         1428.70
2      Rajkot                         1390.06
3  Ananthapur                         1130.13
4    Jamnagar                         1098.17
5    Junagadh                         1076.39
6    Junagadh                         1049.90
7    Junagadh                         1030.40
8    Junagadh                         1022.80
9  Ananthapur                          988.00

In [48]:
#7. Annual Average Maize Yield Across States
query = """
SELECT year, AVG(maize_yield_kg_per_ha) AS avg_maize_yield
FROM agri_data
GROUP BY year
ORDER BY year;
"""

pd.read_sql(query, engine)

    year  avg_maize_yield
0   1966       734.266355
1   1967       869.540323
2   1968       709.261774
3   1969       781.476645
4   1970      1094.176206
5   1971       848.642862
6   1972       895.126141
7   1973       886.839614
8   1974       852.936592
9   1975      1026.008875
10  1976       966.653537
11  1977       946.525113
12  1978       964.877170
13  1979       984.162058
14  1980      1067.085402
15  1981      1119.513826
16  1982      1189.239904
17  1983      1314.558264
18  1984      1226.566817
19  1985      1057.788746
20  1986      1078.989936
21  1987       945.443955
22  1988      1145.877492
23  1989      1324.732186
24  1990      1235.363452
25  1991      1157.018419
26  1992      1450.823000
27  1993      1345.807323
28  1994      1211.294774
29  1995      1344.002336
30  1996      1443.180098
31  1997      1409.269325
32  1998      1419.082219
33  1999      1516.950772
34  2000      1556.488296
35  2001      1758.419775
36  2002      1384.691961
37  2003      1704.555145
38  2004      1619.802444
39  2005      1702.612765
40  2006      1678.536302
41  2007      1990.170257
42  2008      1935.154823
43  2009      1764.596849
44  2010      2078.251383
45  2011      2064.950257
46  2012      2137.156527
47  2013      2343.496323
48  2014      2400.829194
49  2015      2260.076323
50  2016      2463.027685
51  2017      2852.332419

In [49]:
#8. Total Oilseed Area for Each State
query = """
SELECT state_name, SUM(oilseeds_area_1000_ha) AS total_area
FROM agri_data
GROUP BY state_name
ORDER BY total_area DESC;
"""

pd.read_sql(query, engine)

          state_name  total_area
0     Madhya Pradesh   189945.92
1          Rajasthan   142433.47
2        Maharashtra   134069.16
3            Gujarat   130724.71
4          Karnataka    92527.23
5     Andhra Pradesh    87223.49
6         Tamil Nadu    56225.64
7      Uttar Pradesh    43047.07
8             Orissa    39682.05
9          Telangana    35293.43
10            Kerala    34348.94
11           Haryana    21465.54
12       West Bengal    20300.76
13      Chhattisgarh    17267.08
14             Assam    14176.64
15            Punjab     8697.93
16             Bihar     5536.29
17         Jharkhand     2826.29
18       Uttarakhand      993.53
19  Himachal Pradesh      799.25

In [50]:
#9. Highest Rice Yield Districts
query = """
SELECT dist_name, AVG(rice_yield_kg_per_ha) AS avg_rice_yield
FROM agri_data
GROUP BY dist_name
ORDER BY avg_rice_yield DESC
LIMIT 10;
"""

pd.read_sql(query, engine)

      dist_name  avg_rice_yield
0      Ludhiana     3650.434038
1       Sangrur     3532.896731
2  Thirunelveli     3387.505577
3      Bhatinda     3363.158846
4       Madurai     3276.982308
5   Kanyakumari     3240.693462
6      Ferozpur     3234.056154
7       Patiala     3222.130000
8     Jalandhar     3187.027692
9         Salem     3102.583462

In [51]:
#10. Compare Rice vs Wheat for Top 5 States
query = """
SELECT state_name,
       SUM(rice_production_1000_tons) AS rice_total,
       SUM(wheat_production_1000_tons) AS wheat_total
FROM agri_data
GROUP BY state_name
ORDER BY (rice_total + wheat_total) DESC
LIMIT 5;
"""

pd.read_sql(query, engine)

       state_name  rice_total  wheat_total
0   Uttar Pradesh   445597.62    970210.07
1          Punjab   335040.10    593848.90
2     West Bengal   544232.26     32703.86
3         Haryana   107664.90    348429.60
4  Madhya Pradesh    76342.20    338644.25